Project1/app/controllers/artists_controller.rb

SELECT "artists".* FROM "artists" ORDER BY created_at
---
  def index
    @artists = Artist.order('created_at')

INSERT INTO "artists" ("login_id", "password", "name", "description", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @artist = Artist.new(artist_params)
    if @artist.save

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_artist
      @artist = Artist.find(params[:id])