Project1/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" ORDER BY created_at
---
  def index
    @artworks = Artwork.order('created_at')

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "artworks" ("title", "description", "category", "artist_id", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @artist = Artist.find(params[:artist_id])
    @artwork = @artist.artworks.create(artwork_params)

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_artwork
      @artwork = Artwork.find(params[:id])