Project1/app/views/artists/show.html.erb

SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = ?  [["artist_id", 1]]
---
<h2>List of artworks</h2>
<% @artist.artworks.each do |artwork| %>